#+TITLE: FINISHED
#+STARTUP: content

* FINISHED
** DONE this is from todo.  <2016-11-29 Tue 00:10>
   CLOSED: [2016-11-29 Tue 00:18] DEADLINE: <2016-12-01 Thu> SCHEDULED: <2016-11-29 Tue>
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2016-11-29 Tue 00:18]
   :END:
** DONE fix can't setMonitorLayout not in meeting <2016-11-29 Tue 15:09>
   CLOSED: [2016-11-29 Tue 18:23] DEADLINE: <2016-11-29 Tue> SCHEDULED: <2016-11-29 Tue>
   :LOGBOOK:
   - State "DONE"       from "PROJECT"    [2016-11-29 Tue 18:23]
   - State "PROJECT"    from "DONE"       [2016-11-29 Tue 18:23]
   - State "DONE"       from "PROJECT"    [2016-11-29 Tue 18:23]
   :END:
** DONE [#A] add compose interfaces to c9sdk <2016-11-29 Tue 18:18>
   CLOSED: [2016-12-04 Sun 20:29]
   :LOGBOOK:
   - State "DONE"       from "DONE"       [2016-12-04 Sun 20:29]
   - State "DONE"       from "TODO"       [2016-12-04 Sun 20:29]
   :END:
** DONE [#A] add condition for main assi compose of c9sdk <2016-11-29 Tue 18:18>
   CLOSED: [2016-12-04 Sun 20:30]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2016-12-04 Sun 20:30]
   :END:
** DONE [#C] update c9service with sdk 20161128 <2016-11-29 Tue 15:12>
   CLOSED: [2016-11-29 Tue 18:28]
   :LOGBOOK:
   CLOCK: [2017-06-30 Fri 10:52]--[2017-06-30 Fri 10:54] =>  0:02
   - State "DONE"       from "TODO"       [2016-11-29 Tue 18:28]
   :END:
** DONE [#B] change ihi-desktop_edu use peer mode <2016-11-29 Tue 18:17> :@work:
   CLOSED: [2017-06-30 Fri 11:05] DEADLINE: <2016-12-06 Tue> SCHEDULED: <2016-11-29 Tue>
   :LOGBOOK:
   - State "DONE"       from ""           [2017-06-30 Fri 11:05]
   :END:
** DONE [#C] 教育使用对等模式 <2016-12-06 Tue 18:24>
   CLOSED: [2017-06-30 Fri 12:20]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-06-30 Fri 12:20]
   :END:
** DONE [#C] 修复打包机？？ <2016-12-06 Tue 18:24>
   CLOSED: [2017-06-30 Fri 12:21]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-06-30 Fri 12:21]
   :END:
** DONE [#C] Update Emacs <2017-08-20 Sun 02:50> [4/4]                   :@home:
   CLOSED: [2017-08-24 Thu 00:21]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-08-24 Thu 00:21]
   CLOCK: [2017-08-20 Sun 03:35]--[2017-08-20 Sun 03:36] =>  0:01
   :END:
   file:~/.emacs.d/org/task.org::*va%20add%20monitor%20interface
*** DONE use use-package [100%]
	 CLOSED: [2017-08-24 Thu 00:20]
	 :LOGBOOK:
	 - State "DONE"       from "TODO"       [2017-08-24 Thu 00:20]
	 - State "TODO"       from "DONE"       [2017-08-20 Sun 02:52]
	 - State "DONE"       from "NEXT"       [2017-08-20 Sun 02:52]
	 :END:
	- [X] how to use use-package
	- [X] replace my-require-package and require
	- [X] change other config
*** DONE update company
	 CLOSED: [2017-08-24 Thu 00:20]
	 :LOGBOOK:
	 - State "DONE"       from "TODO"       [2017-08-24 Thu 00:20]
	 :END:
*** DONE update toggle
	 CLOSED: [2017-08-24 Thu 00:20]
	 :LOGBOOK:
	 - State "DONE"       from "TODO"       [2017-08-24 Thu 00:20]
	 :END:
*** DONE update jump-to-define <2017-08-20 Sun>
	 SCHEDULED: <2017-08-20 Sun>
   	:PROPERTIES:
   	:CATEGORY: eamcs
   	:LOGGING:  t
   	:ARCHIVE_TIME: 2017-08-20 Sun 03:30
   	:ARCHIVE_FILE: ~/.emacs.d/org/task.org
   	:ARCHIVE_OLPATH: TASKS/Update Emacs <2017-08-20 Sun 02:50>
   	:ARCHIVE_CATEGORY: eamcs
   	:ARCHIVE_TODO: TODO
   	:ARCHIVE_ITAGS: @home
   	:END:

** DONE this is a test
   CLOSED: [2018-12-12 Wed 22:09]
   - State "DONE"       from              [2018-12-12 Wed 22:09]
   <2018-12-12 Wed 16:20>
** DONE this is a test inbox1
   CLOSED: [2018-12-12 Wed 22:09]
   - State "DONE"       from              [2018-12-12 Wed 22:09]
 [2018-12-12 Wed 19:48]
** DONE this is a test  in
   CLOSED: [2018-12-12 Wed 22:09]
   - State "DONE"       from              [2018-12-12 Wed 22:09]
 [2018-12-12 Wed 19:48]
** DONE othis is a test1
   CLOSED: [2018-12-12 Wed 22:05]
   - State "DONE"       from "TODO"       [2018-12-12 Wed 22:05]
   - State "DONE"       from "TODO"       [2018-12-12 Wed 20:41]
  <2018-12-12 Wed 19:40>
** DONE this is a test
   CLOSED: [2018-12-12 Wed 22:10]
   - State "DONE"       from "TODO"       [2018-12-12 Wed 22:10]
 [2018-12-12 Wed 19:41]
** DONE this is a test todo1
   CLOSED: [2018-12-12 Wed 22:10]

   - State "DONE"       from "TODO"       [2018-12-12 Wed 22:10]
 [2018-12-12 Wed 19:48]
** DONE this is a test todo2
   CLOSED: [2018-12-12 Wed 22:10]
   - State "DONE"       from "NEXT"       [2018-12-12 Wed 22:10]
 [2018-12-12 Wed 19:48]


** DONE test
   CLOSED: [2018-12-12 Wed 22:26]
   :LOGBOOK:
   - State "DONE"       from "NEXT"       [2018-12-12 Wed 22:26]
   :END:
 [2018-12-12 Wed 22:26]
* DROP
#+BEGIN: columnview :hlines 1 :id local
| ITEM                                                       | TODO      | PRIORITY | TAGS    |
|------------------------------------------------------------+-----------+----------+---------|
| DROP                                                       |           | B        |         |
| 发布使用新service的普通版本给柴亚伟 <2016-12-06 Tue 18:23> | CANCELLED | C        |         |
| 发布使用新service的普通版本给柴亚伟 <2016-12-06 Tue 18:23> | CANCELLED | C        |         |
| 流加密的更新 <2016-12-06 Tue 18:23>                        | CANCELLED | A        |         |
| va add monitor interface                                   | CANCELLED | A        | :@work: |
#+END:

** CANCELLED [#C] 发布使用新service的普通版本给柴亚伟 <2016-12-06 Tue 18:23>
   CLOSED: [2017-07-13 Thu 13:59] DEADLINE: <2016-12-07 Wed> SCHEDULED: <2016-12-07 Wed>
   :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2017-07-13 Thu 13:59]
   :END:
** CANCELLED [#C] 发布使用新service的普通版本给柴亚伟 <2016-12-06 Tue 18:23>
   CLOSED: [2017-07-13 Thu 14:00] DEADLINE: <2016-12-07 Wed> SCHEDULED: <2016-12-07 Wed>
   :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2017-07-13 Thu 14:00]
   :END:
** CANCELLED [#A] 流加密的更新 <2016-12-06 Tue 18:23>
   CLOSED: [2017-07-13 Thu 14:00]
   :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2017-07-13 Thu 14:00]
   :END:
** CANCELLED [#A] va add monitor interface                               :@work:
   CLOSED: [2018-11-15 Thu 00:27] SCHEDULED: <2017-07-13 Thu> DEADLINE: <2017-07-15 Sat>
   :LOGBOOK:
   CLOCK: [2018-12-12 Wed 19:19]--[2018-12-12 Wed 19:20] =>  0:01
   CLOCK: [2018-12-12 Wed 19:17]
   - State "CANCELLED"  from "NEXT"       [2018-11-15 Thu 00:27]
   - State "TODO"       from "DONE"       [2017-08-20 Sun 03:28]
   - State "DONE"       from "TODO"       [2017-08-20 Sun 03:28]
   - State "TODO"       from "DONE"       [2017-08-20 Sun 02:48]
   - State "DONE"       from "TODO"       [2017-08-20 Sun 02:48]
   - State "TODO"       from "DONE"       [2017-08-20 Sun 02:39]
   - State "DONE"       from "TODO"       [2017-08-20 Sun 02:39]
   :END:
   :PROPERTIES:
   :ARCHIVE_TIME: 2017-08-20 Sun 03:30
   :ARCHIVE_FILE: ~/.emacs.d/org/task.org
   :ARCHIVE_OLPATH: TASKS
   :ARCHIVE_CATEGORY: task
   :ARCHIVE_TODO: TODO
   :END:

   add monitor interface for va to sosp/joyplus
#+BEGIN_SRC json
{
    "rp": 1,
    "ad": "adHash",
    "zone": "",
    "dm": "iPhone6",
    "i": devid,
    "ip": "127.0.0.1",
    "chnl": os-guid,
    "cp": "cp",
    "sp": "sp",
}
#+END_SRC

#+BEGIN_SRC
http://106.75.55.63/advapi/v1/monitor?rq=1&ad=f3fb000b05f11d4162044815db68a0cc&zone=fa9edb6280%207a5548e4e4e6c7bae7faed&dm=a&i=123d225fa4bc2d46c3&ip=10.23.24.12&CP=cntv&SP=njt&ex=%ex%
#+END_SRC
** emacs can't use chinese input                                                :NOTE:
 [2019-07-22 Mon 01:18]
 [[file:~/git/core/client/libiHi/libihi/ihi_uac_wrapper.cpp][file:~/git/core/client/libiHi/libihi/ihi_uac_wrapper.cpp]]
** SOTP 测试接口                                                                :NOTE:
   *** checkUser
   curl -v "http://ihi-sotp.streamocean.com/SOTP/index.php/interface/user/checkUser" -d '{"user_acct": "linsq", "pwd": "linsq"}' -H "Content-Type: application/json"
   *** user
   **** with devId check
   curl -v "http://ihi-sotp.streamocean.com/SOTP/index.php/Interface/content/content/dev/VHD1511050002/user/dt1"
   **** withou devId check
   curl -v "http://ihi-sotp.streamocean.com/SOTP/index.php/Interface/infor/infor/user/dt1"

 [2019-07-29 Mon 13:53]
** 环境                                                                         :NOTE:
   一、公司两台阿里云登录信息
   IP：39.106.102.189 密码：5tream)ceaN
   IP：106.14.8.145 密码：90-=op[]KL;'

   二、三元桥服务器登录信息
   1、先登录到39.106.102.189
   2、ssh m

   三、云视华通云登录信息
   1、先登录到39.106.102.189
   2、ssh ht157 、ssh ht116、ssh ht112

** 内部环境
   |      address | user | password | description       |
   | 172.16.1.231 | root |    12345 | sdk build machine |
   |  172.16.1.21 | root |          | vdn build machine |
   |              |      |          |                   |

   | 172.16.1.116 | root | admin@r3c1010.com | rsk's machine |
   |              |      |                   |               |
 [2019-07-29 Mon 15:25]
** CANCELLED change cp fsm from call callbacks then change state to change state then call callbacks
   CLOSED: [2020-12-17 Thu 03:10]
   :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2020-12-17 Thu 03:10]
   :END:
 [2019-07-22 Mon 01:16]
** CANCELLED loopback master slave use common file
   CLOSED: [2020-12-17 Thu 03:10]
   :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2020-12-17 Thu 03:10]
   :END:
 [2019-07-22 Mon 01:17]
